<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Header nav-links translations
    |--------------------------------------------------------------------------
    */

    'home'          => 'الرئيسية',
    'about'         => 'من نحن',
    'investment'    => 'صندوق الاستثمار',
    'terms'         => 'شروط الاستخدام',
    'privacy'       => 'سياسة الخصوصية',
    'faq'           => 'الأسئلة الشائعة',
    'fullfaq'       => 'الأسئلة الشائعة',
    'contact'       => 'اتصل بنا',
    'login'         => 'تسجيل الدخول',
    'logout'         => 'تسجيل الخروج',

    'profile' => 'الملف الشخصي',
    'dashboard' => 'لوحة التحكم',
    'settings' => 'الإعدادات',
    'user_account' => 'حساب العميل',
    'menu' => 'القائمة',
    'plans' => 'الباقات',

];
