<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Header nav-links translations
    |--------------------------------------------------------------------------
    */

    'home'          => 'الرئيسية',
    'about'         => 'من نحن',
    'investment'    => 'صندوق الاستثمار',
    'terms'         => 'شروط الاستخدام',
    'privacy'       => 'سياسة الخصوصية',
    'faq'           => 'الأسئلة الشائعة',
    'fullfaq'       => 'الأسئلة الشائعة',
    'contact'       => 'اتصل بنا',
    'login'         => 'تسجيل الدخول',


];
