<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Idea
    |--------------------------------------------------------------------------
    */


    'common' => [
        'yes' => 'نعم',
        'no' => 'لا',
        'number' => 'العدد',
        'enter_number' => 'أدخل العدد',
        'large' => 'كبيرة',
        'small' => 'صغيرة',
        'open_spaces' => 'مساحات مفتوحة',
        'factory' => 'مصنع',
        'land_space' => 'أرض',
        'industrial' => 'صناعية',
        'electronic' => 'إلكترونية',
        'other' => 'أخرى',
        'static' => 'ثابتة',
        'dynamic' => 'ديناميكية',
    ],
    'steps' => [
        'step1' => [
            'subtitle' => 'ما هو مجال فكرتك؟',
            'options' => [
                'health'      => 'الصحة والجمال',
                'food'        => 'المطاعم والأطعمة',
                'industry'    => 'الصناعة',
                'marketing'   => 'التسويق والإعلان',
                'public'      => 'الخدمات العامة',
                'designs'     => 'التصاميم المعمارية والفنية',
                'agriculture' => 'الزراعة',
                'websites'    => 'المواقع الإلكترونية',
                'technology'  => 'الاتصالات والتكنولوجيا',
                'tourism'     => 'السفر والسياحة',
                'mining'      => 'التعدين',
                'media'       => 'الإعلام والنشر',
                'games'       => 'الألعاب الإلكترونية',
                'banking'     => 'الخدمات المالية والمصرفية',
                'other'       => 'أخرى',
                'retail'      => 'التجارة العامة والتجزئة',
                'government'  => 'خدمات القطاع الحكومي',
                'transport'   => 'التخزين والنقل',
                'vehicles'    => 'المركبات والمحركات',
                'software'    => 'البرمجيات والتطبيقات',
                'entertainment' => 'الترفيه والتسلية',
                'contracting'   => 'المقاولات',
                'systems'       => 'أنظمة النقل',
                'education'     => 'العلم والتعليم',
                'realestate'    => 'العقارات والتطوير العمراني',
                'environment'   => 'حماية البيئة والاستدامة',
            ],
        ],
        'step2' => [
            'subtitle' => 'أفضل الدول / المناطق لتنفيذ الفكرة (بحد أقصى 3 دول)',
            'options' => [
                ['code' => 'LB', 'name' => 'لبنان'],
                ['code' => 'TN', 'name' => 'تونس'],
                ['code' => 'DZ', 'name' => 'الجزائر'],
                ['code' => 'JO', 'name' => 'الأردن'],
                ['code' => 'SA', 'name' => 'المملكة العربية السعودية'],
                ['code' => 'QA', 'name' => 'قطر'],
                ['code' => 'OM', 'name' => 'عُمان'],
                ['code' => 'MA', 'name' => 'المغرب'],
                ['code' => 'LY', 'name' => 'ليبيا'],
                ['code' => 'SD', 'name' => 'السودان'],
                ['code' => 'PS', 'name' => 'فلسطين'],
                ['code' => 'IQ', 'name' => 'العراق'],
                ['code' => 'IR', 'name' => 'إيران'],
                ['code' => 'TR', 'name' => 'تركيا'],
                ['code' => 'NAF', 'name' => 'شمال أفريقيا'],
                ['code' => 'LEV', 'name' => 'بلاد الشام'],
                ['code' => 'GULF', 'name' => 'دول الخليج'],
                ['code' => 'AE', 'name' => 'الإمارات العربية المتحدة'],
                ['code' => 'KW', 'name' => 'الكويت'],
                ['code' => 'BH', 'name' => 'البحرين'],
                ['code' => 'EG', 'name' => 'مصر'],
                ['code' => 'AM_AU', 'name' => 'قارة أمريكا وأستراليا'],
                ['code' => 'CSA', 'name' => 'أفريقيا الوسطى والجنوبية'],
                ['code' => 'EU', 'name' => 'الاتحاد الأوروبي'],
                ['code' => 'CN', 'name' => 'الصين'],
                ['code' => 'IN_PK', 'name' => 'الهند وباكستان'],
                ['code' => 'MENA', 'name' => 'الشرق الأوسط وشمال أفريقيا'],
                ['code' => 'ME', 'name' => 'الشرق الأوسط'],
                ['code' => 'YE', 'name' => 'اليمن'],
            ]
        ],
        'step3' => [
            'subtitle' => 'التكلفة التقديرية لتنفيذ الفكرة',

            'types' => [
                'one-time' => 'تكاليف لمرة واحدة',
                'annual'   => 'تكاليف سنوية',
            ],

            'one_time_ranges' => [
                1 => 'من 1,000 إلى 5,000 دولار<br>(3,700 إلى 18,500 ريال)',
                2 => 'من 6,000 إلى 10,000 دولار<br>(22,200 إلى 37,000 ريال)',
                3 => 'من 51,000 إلى 100,000 دولار<br>(188,800 إلى 370,000 ريال)',
                4 => 'من 101,000 إلى 250,000 دولار<br>(374,000 إلى 925,750 ريال)',
                5 => 'من 1 مليون إلى 2 مليون دولار<br>(3.7 مليون إلى 7.4 مليون ريال)',
                6 => 'من 2 مليون إلى 5 مليون دولار<br>(7.4 مليون إلى 18.5 مليون ريال)',
                7 => 'من 50 مليون إلى 100 مليون دولار<br>(185 مليون إلى 370 مليون ريال)',
            ],

            'annual_ranges' => [
                1 => 'من 11,000 إلى 20,000 دولار<br>(40,700 إلى 74,000 ريال)',
                2 => 'من 21,000 إلى 50,000 دولار<br>(77,700 إلى 185,000 ريال)',
                3 => 'من 251,000 إلى 500,000 دولار<br>(929,450 إلى 1,851,500 ريال)',
                4 => 'من 501,000 إلى 1,000,000 دولار<br>(1,855,000 إلى 3,700,000 ريال)',
                5 => 'من 5 مليون إلى 10 مليون دولار<br>(18.5 مليون إلى 37 مليون ريال)',
                6 => 'من 10 مليون إلى 50 مليون دولار<br>(37 مليون إلى 185 مليون ريال)',
                7 => 'أكثر من 100 مليون دولار<br>(أكثر من 370 مليون ريال)',
            ],
        ],
        'step4' => [
            'subtitle' => 'الأرباح المتوقعة من تنفيذ الفكرة',

            'types' => [
                'one_time' => 'أرباح لمرة واحدة',
                'annual'   => 'أرباح سنوية',
            ],

            'one_time_ranges' => [
                1 => 'من 1,000 إلى 5,000 دولار<br>(3,700 إلى 18,500 ريال)',
                2 => 'من 6,000 إلى 10,000 دولار<br>(22,200 إلى 37,000 ريال)',
                3 => 'من 51,000 إلى 100,000 دولار<br>(188,800 إلى 370,000 ريال)',
                4 => 'من 101,000 إلى 250,000 دولار<br>(374,000 إلى 925,750 ريال)',
                5 => 'من 1 مليون إلى 2 مليون دولار<br>(3.7 مليون إلى 7.4 مليون ريال)',
                6 => 'من 2 مليون إلى 5 مليون دولار<br>(7.4 مليون إلى 18.5 مليون ريال)',
                7 => 'من 50 مليون إلى 100 مليون دولار<br>(185 مليون إلى 370 مليون ريال)',
            ],

            'annual_ranges' => [
                1 => 'من 11,000 إلى 20,000 دولار<br>(40,700 إلى 74,000 ريال)',
                2 => 'من 21,000 إلى 50,000 دولار<br>(77,700 إلى 185,000 ريال)',
                3 => 'من 251,000 إلى 500,000 دولار<br>(929,450 إلى 1,851,500 ريال)',
                4 => 'من 501,000 إلى 1,000,000 دولار<br>(1,855,000 إلى 3,700,000 ريال)',
                5 => 'من 5 مليون إلى 10 مليون دولار<br>(18.5 مليون إلى 37 مليون ريال)',
                6 => 'من 10 مليون إلى 50 مليون دولار<br>(37 مليون إلى 185 مليون ريال)',
                7 => 'أكثر من 100 مليون دولار<br>(أكثر من 370 مليون ريال)',
            ],
        ],
        'step5' => [
            'subtitle' => 'متطلبات تنفيذ الفكرة',
            'company' => 'تأسيس شركة',
            'office_spaces' => 'المكاتب',
            'staff' => 'موظفون متخصصون',
            'workers' => 'عمال غير مهرة',
            'executive_spaces' => 'المساحات التنفيذية',
            'equipment' => 'الأجهزة والمعدات',
            'software' => 'البرامج والتطبيقات',
            'website' => 'موقع إلكتروني',
        ],
        'step6' => [
            'subtitle' => 'توزيع رأس المال المطلوب لتنفيذ الفكرة',
            'fields' => [
                'company' => 'تأسيس شركة',
                'assets' => 'الأصول الثابتة',
                'salaries' => 'الرواتب الشهرية',
                'operating' => 'المصروفات التشغيلية',
                'other' => 'أخرى',
            ],
            'placeholder' => 'أدخل النسبة',
            'total' => 'الإجمالي',
            'perfect' => 'ممتاز! التوزيع متوازن.',
            'must_equal' => ' يجب أن يساوي التوزيع الإجمالي 100٪.',
        ],
        'step7' => [
            'subtitle' => 'مساهمتك في تنفيذ الفكرة هي:',
            'sell' => 'أرغب في بيع الفكرة بالكامل دون أي مساهمة في تنفيذها',
            'idea' => 'سأساهم بالفكرة فقط',
            'capital' => 'سأساهم برأس مال لتنفيذ الفكرة',
            'personal' => 'سأساهم شخصيًا في تنفيذ الفكرة',
            'both' => 'سأساهم برأس المال + سأساهم شخصيًا في تنفيذ الفكرة',
            'full_time' => 'دوام كامل',
            'part_time' => 'دوام جزئي',
            'supervision' => 'إشراف فقط',
            'amount' => 'المبلغ',
            'percent' => 'النسبة المئوية',
            'total_error' => 'يجب أن يكون المجموع 100٪.',
        ],
        'step8' => [
            'title' => 'تقديم الفكرة',
            'subtitle' => 'متطلباتك المحددة مقابل الفكرة',
            'profit_share' => 'حصة من الأرباح',
            'one_time_sum' => 'مبلغ مرة واحدة',
            'profit_plus_sum' => 'حصة من الأرباح + مبلغ مالي',
            'choose_one' => 'يجب اختيار خيار واحد على الأقل (الأرباح، المبلغ لمرة واحدة، أو الجمع بينهما).',
            'combo_complete' => 'إذا اخترت حصة من الأرباح + مبلغ مالي، يجب إدخال المبلغ بالدولار، والريال، واختيار النسبة المئوية.',

            'choose_one' => 'يرجى اختيار نوع واحد من العائد على الأقل.',
            'only_one_currency' => 'يرجى إدخال المبلغ بعملة واحدة فقط (إما ريال أو دولار).',
            'combo_percentage_required' => 'في حالة العائد المجمّع، يجب إدخال النسبة بالإضافة إلى المبلغ بعملة واحدة.',
            'combo_currency_required' => 'في حالة العائد المجمّع، يجب إدخال المبلغ بعملة واحدة مع النسبة.',

            // for show in summary
            'profit_share' => 'حصة من الأرباح',
            'fixed_amount' => 'مبلغ مالي',
            'combo' => 'حصة من الأرباح + مبلغ مالي',
        ],
        'step9' => [
            'subtitle' => 'ملخص الفكرة وملفاتها',
            'placeholder' => 'اكتب ملخصًا واضحًا لفكرتك',
            'confidential_info' => 'إذا كانت هناك أي معلومات مهمة وسرية حول الفكرة، ننصح بعدم ذكرها بوضوح في هذا الملخص للحفاظ على حقوقك وحمايتها من السرقة.',

            'max_characters' => '2000 حرف كحد أقصى',
            'file_format' => 'صيغة الملفات يجب أن تكون Word أو Excel أو PDF أو صور',

            'first_time_question' => 'الملكية الفكرية',
            'show_public' => 'أود عرضها للجمهور',
            'keep_private' => 'للاستخدام في الموقع وحفظ حقوق الملكية الفكرية',

            'selected_file' => 'الملف المرفوع',
            'delete_file' => 'حذف الملف',
            'delete_confirm' => 'هل أنت متأكد من حذف الملف؟',
        ],
        'step10' => [
            'title' => 'ملخص فكرتك المميزة',
            'project' => 'المشروع',
            'classification' => 'تصنيف الفكرة',
            'capital' => 'رأس المال المطلوب',
            'expected_profit' => 'الأرباح المتوقعة',
            'best_countries' => 'أفضل الدول لتنفيذ الفكرة',
            'contact_way' => 'طريقة التواصل المفضلة معك',
            'resources' => 'متطلبات تنفيذ الفكرة',
            'contribution' => 'ستساهم بـ',
            'returns' => 'متطلباتك',
            'capital_distribution' => 'توزيع رأس المال المطلوب',
            'attachments' => 'الملفات المرفقة',
            'summary' => 'ملخص الفكرة',
        ],
    ],
    'currency' => [
        'dollar' => 'دولار',
        'sar' => 'ريال سعودي',
    ],
    'form' => [
        'previous' => 'السابق',
        'next' => 'التالي',
        'finish' => 'قدم فكرتك',
        'edit' => 'هنالك بعض المعلومات الغير صحيحة، أرغب بالمراجعة',
    ],
    'validation' => [
        'step1' => [
            'idea_field' => 'يجب اختيار مجال فكرتك'
        ],
        'step2' => [
            'countries' => 'يجب اختيار على الأقل منطقة لتنفيذ الفكرة ',
        ],
        'step3' => [
            'cost_type'  => 'يجب اختيار نوع تكلفة ',
            'cost_range' => 'يجب إدخال نطاق تكلفة ',
        ],
        'step4' => [
            'profit_type'  => 'يجب اختيار نوع ربح ',
            'profit_range' => 'يجب إدخال نطاق ربح ',
        ],
        'step5' => [
            'company'               => 'يجب تحديد ما إذا كان لديك شركة',
            'space_type'            => 'يجب اختيار نوع مساحة صحيح',
            'staff'                 => 'يجب تحديد ما إذا كان لديك موظفون',
            'staff_number'          => 'يجب إدخال عدد الموظفين (بحد أدنى 1)',
            'workers'               => 'يجب تحديد ما إذا كان لديك عمال',
            'workers_number'        => 'يجب إدخال عدد العمال (بحد أدنى 1)',
            'executive_spaces'      => 'يجب تحديد ما إذا كان لديك مساحات تنفيذية',
            'executive_spaces_type' => 'يجب اختيار نوع المساحة التنفيذية بشكل صحيح',
            'equipment'             => 'يجب تحديد ما إذا كان لديك معدات',
            'equipment_type'        => 'يجب اختيار نوع المعدات بشكل صحيح',
            'software'              => 'يجب تحديد ما إذا كان لديك برمجيات',
            'software_type'         => 'يجب اختيار نوع البرمجيات بشكل صحيح',
            'website'               => 'يجب تحديد ما إذا كان لديك موقع إلكتروني',
        ],
        'step6' => [
            'company'   => 'يجب إدخال نسبة الشركة بشكل صحيح (0–100)',
            'assets'    => 'يجب إدخال نسبة الأصول بشكل صحيح (0–100)',
            'salaries'  => 'يجب إدخال نسبة الرواتب بشكل صحيح (0–100)',
            'operating' => 'يجب إدخال نسبة التشغيل بشكل صحيح (0–100)',
            'other'     => 'يجب إدخال نسبة المصاريف الأخرى بشكل صحيح (0–100)',
        ],
        'step7' => [
            'contribute_type' => 'يجب اختيار نوع مساهمة صحيح',
            'staff' => 'يجب تحديد نوع التوظيف عند اختيار مساهمة رأس المال',
            'staff_person_money' => 'يجب تحديد نوع التوظيف عند اختيار كلاهما',
            'money_amount' => 'يجب إدخال مبلغ صحيح (الحد الأدنى 1)',
            'money_percent' => 'يجب إدخال نسبة صحيحة (1-100)',
            'person_money_amount' => 'يجب إدخال مبلغ المساهمة الشخصية صحيح (الحد الأدنى 1)',
            'person_money_percent' => 'يجب إدخال نسبة المساهمة الشخصية صحيحة (1-100)',

            'money_required_one' => 'يجب إدخال المبلغ أو النسبة',
            'money_both_prohibited' => 'لا يمكن إدخال المبلغ والنسبة معاً',
            'person_money_required_one' => 'يجب إدخال مبلغ المساهمة الشخصية أو النسبة',
            'person_money_both_prohibited' => 'لا يمكن إدخال مبلغ المساهمة الشخصية والنسبة معاً',
        ],
        'step8' => [
            'profit_only_percentage'   => 'يجب أن تكون نسبة الأرباح من القيم المسموح بها.',

            'one_time_dollar_numeric'  => 'المبلغ لمرة واحدة بالدولار يجب أن يكون رقمًا.',
            'one_time_dollar_min'      => 'المبلغ لمرة واحدة بالدولار يجب ألا يقل عن 1.',

            'one_time_sar_numeric'     => 'المبلغ لمرة واحدة بالريال يجب أن يكون رقمًا.',
            'one_time_sar_min'         => 'المبلغ لمرة واحدة بالريال يجب ألا يقل عن 1.',

            'combo_dollar_numeric'     => 'المبلغ المجمع بالدولار يجب أن يكون رقمًا.',
            'combo_dollar_min'         => 'المبلغ المجمع بالدولار يجب ألا يقل عن 1.',

            'combo_sar_numeric'        => 'المبلغ المجمع بالريال يجب أن يكون رقمًا.',
            'combo_sar_min'            => 'المبلغ المجمع بالريال يجب ألا يقل عن 1.',

            'combo_percentage'         => 'نسبة المزيج يجب أن تكون من القيم المسموح بها.',
        ],
        'step9' => [
            'summary_required' => 'ملخص الفكرة مطلوب.',
            'summary_string'   => 'يجب أن يكون الملخص نصًا.',
            'summary_max'      => 'يجب ألا يزيد الملخص عن 2000 حرف.',

            'attachments_file'  => 'يجب أن يكون كل مرفق ملفًا صحيحًا.',
            'attachments_mimes' => 'يجب أن تكون صيغة الملفات: pdf, doc, docx, xls, xlsx, jpg, jpeg, png.',
            'attachments_max'   => 'يجب ألا يزيد حجم كل ملف مرفق عن 10 ميجابايت.',


            'visibility_required' => 'يرجى اختيار خيار العرض أولاً.',
            'visibility_in'       => 'خيار العرض المحدد غير صالح.',
        ],
    ]
];
