<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Idea
    |--------------------------------------------------------------------------
    */


    'common' => [
        'yes' => 'نعم',
        'no' => 'لا',
        'number' => 'العدد',
        'enter_number' => 'أدخل العدد',
        'large' => 'كبيرة',
        'small' => 'صغيرة',
        'open_spaces' => 'مساحات مفتوحة',
        'factory' => 'مصنع',
        'land_space' => 'أرض',
        'industrial' => 'صناعية',
        'electronic' => 'إلكترونية',
        'other' => 'أخرى',
        'static' => 'ثابتة',
        'dynamic' => 'ديناميكية',
    ],
    'steps' => [
        'step1' => [
            'subtitle' => 'المجالات التي ترغب في الاستثمار أو المشاركة فيها',
            'options' => [
                'health'      => 'الصحة والجمال',
                'food'        => 'المطاعم والأطعمة',
                'industry'    => 'الصناعة',
                'marketing'   => 'التسويق والإعلان',
                'public'      => 'الخدمات العامة',
                'designs'     => 'التصاميم المعمارية والفنية',
                'agriculture' => 'الزراعة',
                'websites'    => 'المواقع الإلكترونية',
                'technology'  => 'الاتصالات والتكنولوجيا',
                'tourism'     => 'السفر والسياحة',
                'mining'      => 'التعدين',
                'media'       => 'الإعلام والنشر',
                'games'       => 'الألعاب الإلكترونية',
                'banking'     => 'الخدمات المالية والمصرفية',
                'other'       => 'أخرى',
                'retail'      => 'التجارة العامة والتجزئة',
                'government'  => 'خدمات القطاع الحكومي',
                'transport'   => 'التخزين والنقل',
                'vehicles'    => 'المركبات والمحركات',
                'software'    => 'البرمجيات والتطبيقات',
                'entertainment' => 'الترفيه والتسلية',
                'contracting'   => 'المقاولات',
                'systems'       => 'أنظمة النقل',
                'education'     => 'العلم والتعليم',
                'realestate'    => 'العقارات والتطوير العمراني',
                'environment'   => 'حماية البيئة والاستدامة',
            ],
        ],
        'step2' => [
            'subtitle' => 'أفضل الدول / المناطق لتنفيذ الفكرة (بحد أقصى 3 دول)',
            'options' => [
                'لبنان',
                'تونس',
                'الجزائر',
                'الأردن',
                'المملكة العربية السعودية',
                'قطر',
                'عُمان',
                'المغرب',
                'ليبيا',
                'السودان',
                'فلسطين',
                'العراق',
                'إيران',
                'تركيا',
                'شمال أفريقيا',
                'بلاد الشام',
                'دول الخليج',
                'الإمارات العربية المتحدة',
                'الكويت',
                'البحرين',
                'مصر',
                'قارة أمريكا وأستراليا',
                'أفريقيا الوسطى والجنوبية',
                'الاتحاد الأوروبي',
                'الصين',
                'الهند وباكستان',
                'الشرق الأوسط وشمال أفريقيا',
                'الشرق الأوسط',
                'اليمن',
            ],
        ],
    ],
    'currency' => [
        'dollar' => 'دولار',
        'sar' => 'ريال سعودي',
    ],
    'form' => [
        'previous' => 'السابق',
        'next' => 'التالي',
        'finish' => 'إنهاء',
    ],
    'validation' => [
        'step1' => [
            'investor_field' => 'يجب اختيار مجال استثمارك'
        ],
        'step2' => [
            'countries' => 'يجب اختيار على الأقل منطقة لتنفيذ الفكرة ',
        ],
        'step3' => [
            'cost_type'  => 'يجب اختيار نوع تكلفة ',
            'cost_range' => 'يجب إدخال نطاق تكلفة ',
        ],
        'step4' => [
            'profit_type'  => 'يجب اختيار نوع ربح صحيح',
            'profit_range' => 'يجب إدخال نطاق ربح صحيح',
        ],
        'step5' => [
            'company'               => 'يجب تحديد ما إذا كان لديك شركة',
            'space_type'            => 'يجب اختيار نوع مساحة صحيح',
            'staff'                 => 'يجب تحديد ما إذا كان لديك موظفون',
            'staff_number'          => 'يجب إدخال عدد الموظفين (بحد أدنى 1)',
            'workers'               => 'يجب تحديد ما إذا كان لديك عمال',
            'workers_number'        => 'يجب إدخال عدد العمال (بحد أدنى 1)',
            'executive_spaces'      => 'يجب تحديد ما إذا كان لديك مساحات تنفيذية',
            'executive_spaces_type' => 'يجب اختيار نوع المساحة التنفيذية بشكل صحيح',
            'equipment'             => 'يجب تحديد ما إذا كان لديك معدات',
            'equipment_type'        => 'يجب اختيار نوع المعدات بشكل صحيح',
            'software'              => 'يجب تحديد ما إذا كان لديك برمجيات',
            'software_type'         => 'يجب اختيار نوع البرمجيات بشكل صحيح',
            'website'               => 'يجب تحديد ما إذا كان لديك موقع إلكتروني',
        ],
        'step6' => [
            'company'   => 'يجب إدخال نسبة الشركة بشكل صحيح (0–100)',
            'assets'    => 'يجب إدخال نسبة الأصول بشكل صحيح (0–100)',
            'salaries'  => 'يجب إدخال نسبة الرواتب بشكل صحيح (0–100)',
            'operating' => 'يجب إدخال نسبة التشغيل بشكل صحيح (0–100)',
            'other'     => 'يجب إدخال نسبة المصاريف الأخرى بشكل صحيح (0–100)',
        ],
        'step7' => [
            'contribute_type'     => 'يجب اختيار نوع المساهمة بشكل صحيح',
            'staff'               => 'يجب تحديد نوع الموظفين عند اختيار المساهمة برأس المال',
            'staff_person_money'  => 'يجب تحديد نوع الموظفين عند اختيار المساهمة بالاثنين معًا',
            'money_amount'        => 'يجب إدخال مبلغ مالي صحيح (الحد الأدنى 1)',
            'money_percent'       => 'يجب إدخال نسبة مالية صحيحة (من 1 إلى 100)',
            'person_money_amount' => 'يجب إدخال مبلغ مالي شخصي صحيح (الحد الأدنى 1)',
            'person_money_percent' => 'يجب إدخال نسبة مالية شخصية صحيحة (من 1 إلى 100)',
        ],
        'step8' => [
            'profit_only_percentage'   => 'يجب أن تكون نسبة الأرباح من القيم المسموح بها.',

            'one_time_dollar_numeric'  => 'المبلغ لمرة واحدة بالدولار يجب أن يكون رقمًا.',
            'one_time_dollar_min'      => 'المبلغ لمرة واحدة بالدولار يجب ألا يقل عن 1.',

            'one_time_sar_numeric'     => 'المبلغ لمرة واحدة بالريال يجب أن يكون رقمًا.',
            'one_time_sar_min'         => 'المبلغ لمرة واحدة بالريال يجب ألا يقل عن 1.',

            'combo_dollar_numeric'     => 'المبلغ المجمع بالدولار يجب أن يكون رقمًا.',
            'combo_dollar_min'         => 'المبلغ المجمع بالدولار يجب ألا يقل عن 1.',

            'combo_sar_numeric'        => 'المبلغ المجمع بالريال يجب أن يكون رقمًا.',
            'combo_sar_min'            => 'المبلغ المجمع بالريال يجب ألا يقل عن 1.',

            'combo_percentage'         => 'نسبة المزيج يجب أن تكون من القيم المسموح بها.',
        ],
        'step9' => [
            'summary_required' => 'ملخص الفكرة مطلوب.',
            'summary_string'   => 'يجب أن يكون الملخص نصًا.',
            'summary_max'      => 'يجب ألا يزيد الملخص عن 2000 حرف.',

            'attachments_file'  => 'يجب أن يكون كل مرفق ملفًا صحيحًا.',
            'attachments_mimes' => 'يجب أن تكون صيغة الملفات: pdf, doc, docx, xls, xlsx, jpg, jpeg, png.',
            'attachments_max'   => 'يجب ألا يزيد حجم كل ملف مرفق عن 10 ميجابايت.',
        ],
    ]
];
