<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Idea
    |--------------------------------------------------------------------------
    */


    'common' => [
        'yes' => 'نعم',
        'no' => 'لا',
        'number' => 'العدد',
        'enter_number' => 'أدخل العدد',
        'large' => 'كبيرة',
        'small' => 'صغيرة',
        'open_spaces' => 'مساحات مفتوحة',
        'factory' => 'مصنع',
        'land_space' => 'أرض',
        'industrial' => 'صناعية',
        'electronic' => 'إلكترونية',
        'other' => 'أخرى',
        'static' => 'ثابتة',
        'dynamic' => 'ديناميكية',
    ],
    'steps' => [
        'step1' => [
            'subtitle' => 'المجالات التي ترغب في الاستثمار أو المشاركة فيها',
            'options' => [
                'health'      => 'الصحة والجمال',
                'food'        => 'المطاعم والأطعمة',
                'industry'    => 'الصناعة',
                'marketing'   => 'التسويق والإعلان',
                'public'      => 'الخدمات العامة',
                'designs'     => 'التصاميم المعمارية والفنية',
                'agriculture' => 'الزراعة',
                'websites'    => 'المواقع الإلكترونية',
                'technology'  => 'الاتصالات والتكنولوجيا',
                'tourism'     => 'السفر والسياحة',
                'mining'      => 'التعدين',
                'media'       => 'الإعلام والنشر',
                'games'       => 'الألعاب الإلكترونية',
                'banking'     => 'الخدمات المالية والمصرفية',
                'other'       => 'أخرى',
                'retail'      => 'التجارة العامة والتجزئة',
                'government'  => 'خدمات القطاع الحكومي',
                'transport'   => 'التخزين والنقل',
                'vehicles'    => 'المركبات والمحركات',
                'software'    => 'البرمجيات والتطبيقات',
                'entertainment' => 'الترفيه والتسلية',
                'contracting'   => 'المقاولات',
                'systems'       => 'أنظمة النقل',
                'education'     => 'العلم والتعليم',
                'realestate'    => 'العقارات والتطوير العمراني',
                'environment'   => 'حماية البيئة والاستدامة',
            ],
        ],
        'step2' => [
            'subtitle' => 'أفضل الدول / المناطق لتنفيذ الفكرة (بحد أقصى 3 دول)',
            'options' => [
                'لبنان',
                'تونس',
                'الجزائر',
                'الأردن',
                'المملكة العربية السعودية',
                'قطر',
                'عُمان',
                'المغرب',
                'ليبيا',
                'السودان',
                'فلسطين',
                'العراق',
                'إيران',
                'تركيا',
                'شمال أفريقيا',
                'بلاد الشام',
                'دول الخليج',
                'الإمارات العربية المتحدة',
                'الكويت',
                'البحرين',
                'مصر',
                'قارة أمريكا وأستراليا',
                'أفريقيا الوسطى والجنوبية',
                'الاتحاد الأوروبي',
                'الصين',
                'الهند وباكستان',
                'الشرق الأوسط وشمال أفريقيا',
                'الشرق الأوسط',
                'اليمن',
            ],
        ],
        'step3' => [],
        'step4' => [
            'subtitle' => 'المساهمات التي ترغب في الحصول عليها في الفكرة المتميزة',
            'sell' => 'أرغب في بيع الفكرة بالكامل دون أي مساهمة في تنفيذها',
            'idea' => 'سأساهم بالفكرة فقط',
            'capital' => 'سأساهم برأس مال لتنفيذ الفكرة',
            'personal' => 'سأساهم شخصيًا في تنفيذ الفكرة',
            'both' => 'سأساهم برأس المال + سأساهم شخصيًا في تنفيذ الفكرة',
            'full_time' => 'دوام كامل',
            'part_time' => 'دوام جزئي',
            'supervision' => 'إشراف فقط',
            'amount' => 'المبلغ',
            'percent' => 'النسبة المئوية',
            'total_error' => 'يجب أن يكون المجموع 100٪.',
        ],
    ],
    'currency' => [
        'dollar' => 'دولار',
        'sar' => 'ريال سعودي',
    ],
    'form' => [
        'previous' => 'السابق',
        'next' => 'التالي',
        'finish' => 'إنهاء',
    ],
    'validation' => [
        'step1' => [
            'investor_field' => 'يجب اختيار مجال استثمارك'
        ],
        'step2' => [
            'countries' => 'يجب اختيار على الأقل منطقة لتنفيذ الفكرة ',
        ],
        'step3' => [
            'company_required' => 'يرجى اختيار ما إذا كان لديك شركة أم لا.',
            'company_in' => 'خيار غير صالح للشركة.',
            'staff_required' => 'يرجى اختيار نعم أو لا للموظفين المتخصصين.',
            'workers_required' => 'يرجى اختيار نعم أو لا للعاملين غير المهرة.',
            'spaces_required' => 'يرجى اختيار نعم أو لا للمساحات التنفيذية.',
            'equipment_required' => 'يرجى اختيار نعم أو لا للأجهزة والمعدات.',
            'software_required' => 'يرجى اختيار نعم أو لا للبرامج والتطبيقات.',
            'website_required' => 'يرجى اختيار نعم أو لا للموقع الإلكتروني.',
            'number_min' => 'يجب أن يكون العدد على الأقل 1.',
            'number_workers_min' => 'يجب أن يكون عدد العاملين غير المهرة على الأقل 1.',
        ],
    ]
];
